# Header
## Header
### Header
#### Header

<!-- ### Predict if a person will buy a product based on age and salary. -->

In [2]:
import pandas as pd

# Simple data
data = pd.DataFrame({
    'Age': [22, 25, 47, 52, 46, 56],
    'Salary': [15000, 29000, 48000, 60000, 52000, 81000],
    'Purchased': [0, 0, 1, 1, 1, 1]  # Target: 0 = No, 1 = Yes
})
data

   Age  Salary  Purchased
0   22   15000          0
1   25   29000          0
2   47   48000          1
3   52   60000          1
4   46   52000          1
5   56   81000          1